RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_ertc.c
/**
 **************************************************************************
 * File Name    : at32f4xx_ertc.c
 * Description  : at32f4xx ERTC source file
 * Date         : 2018-03-15
 * Version      : V1.0.4
 **************************************************************************
 */

/* Includes ------------------------------------------------------------------*/
#include "at32f4xx_ertc.h"
#include "at32f4xx_rcc.h"
/** @addtogroup at32f4xx_StdPeriph_Driver
  * @{
  */

/** @defgroup ERTC
  * @brief ERTC driver modules
  * @{
  */

#if defined (AT32F415xx)

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/

/* Masks Definition */
#define ERTC_TIME_RESERVED_MASK    ((uint32_t)0x007F7F7F)
#define ERTC_DATE_RESERVED_MASK    ((uint32_t)0x00FFFF3F)
#define ERTC_INIT_MASK             ((uint32_t)0xFFFFFFFF)
#define ERTC_RSF_MASK              ((uint32_t)0xFFFFFF5F)
#define ERTC_FLAGS_MASK            ((uint32_t)(ERTC_FLAG_TSOF | ERTC_FLAG_TSF | ERTC_FLAG_WATF | \
                                            ERTC_FLAG_ALBF | ERTC_FLAG_ALAF | ERTC_FLAG_INITF | \
                                            ERTC_FLAG_RSF | ERTC_FLAG_INITS | ERTC_FLAG_WATWF | \
                                            ERTC_FLAG_ALBWF | ERTC_FLAG_ALAWF | ERTC_FLAG_TP1F | \
                                            ERTC_FLAG_TP2F | ERTC_FLAG_RECALPDF | ERTC_FLAG_SFP))

#define INITMODE_TMROUT           ((uint32_t) 0x00010000)
#define SYNCHRO_TMROUT            ((uint32_t) 0x00020000)
#define RECALPDF_TMROUT           ((uint32_t) 0x00020000)
#define SFP_TMROUT                ((uint32_t) 0x00001000)

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
static uint8_t ERTC_ByteToBcd2(uint8_t Value);
static uint8_t ERTC_Bcd2ToByte(uint8_t Value);

/* Private functions ---------------------------------------------------------*/

/** @defgroup RTC_Private_Functions
  * @{
  */


/**
  * @brief  Deinitializes the ERTC registers to their default reset values.
  * @note   This function doesn't reset the ERTC Clock source and ERTC Backup Data
  *         registers.
  * @param  None
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: ERTC registers are deinitialized
  *          - ERROR: ERTC registers are not deinitialized
  */
ErrorStatus ERTC_Reset(void)
{
  __IO uint32_t wutcounter = 0x00;
  uint32_t wutwfstatus = 0x00;
  ErrorStatus status = ERROR;

  /* Disable the write protection for ERTC registers */
  ERTC->WPR = 0xCA;
  ERTC->WPR = 0x53;

  /* Set Initialization mode */
  if (ERTC_EnterInitMode() == ERROR)
  {
    status = ERROR;
  }
  else
  {
    /* Reset TIME, DATE and CTRL registers */
    ERTC->TIME = (uint32_t)0x00000000;
    ERTC->DATE = (uint32_t)0x00002101;
    /* Reset All CTRL bits except CTRL[2:0] */
    ERTC->CTRL &= (uint32_t)0x00000007;

    /* Wait till ERTC WUTWF flag is set and if Time out is reached exit */
    do
    {
      wutwfstatus = ERTC->ISTS & ERTC_ISTS_WATWF;
      wutcounter++;
    } while((wutcounter != INITMODE_TMROUT) && (wutwfstatus == 0x00));

    if ((ERTC->ISTS & ERTC_ISTS_WATWF) == RESET)
    {
      status = ERROR;
    }
    else
    {
      /* Reset all ERTC CTRL register bits */
      ERTC->CTRL &= (uint32_t)0x00000000;
      ERTC->WATR  = (uint32_t)0x0000FFFF;
      ERTC->PSC   = (uint32_t)0x007F00FF;
      ERTC->CAL   = (uint32_t)0x00000000;
      ERTC->ALA   = (uint32_t)0x00000000;
      ERTC->ALB   = (uint32_t)0x00000000;
      ERTC->SFCTR = (uint32_t)0x00000000;
      ERTC->CCR   = (uint32_t)0x00000000;
      ERTC->ALASBS = (uint32_t)0x00000000;
      ERTC->ALBSBS = (uint32_t)0x00000000;

      /* Reset ISTS register and exit initialization mode */
      ERTC->ISTS = (uint32_t)0x00000000;

      /* Reset Tamper and alternate functions configuration register */
      ERTC->TPAF = 0x00000000;

      if(ERTC_WaitForSynchro() == ERROR)
      {
        status = ERROR;
      }
      else
      {
        status = SUCCESS;
      }
    }
  }

  /* Enable the write protection for ERTC registers */
  ERTC->WPR = 0xFF;

  return status;
}

/**
  * @brief  Initializes the ERTC registers according to the specified parameters
  *         in ERTC_InitStruct.
  * @param  ERTC_InitStruct: pointer to a ERTC_InitType structure that contains
  *         the configuration information for the ERTC peripheral.
  * @note   The ERTC Prescaler register is write protected and can be written in
  *         initialization mode only.
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: ERTC registers are initialized
  *          - ERROR: ERTC registers are not initialized
  */
ErrorStatus ERTC_Init(ERTC_InitType* ERTC_InitStruct)
{
  ErrorStatus status = ERROR;

  /* Check the parameters */
  assert_param(IS_ERTC_HOUR_FORMAT(ERTC_InitStruct->ERTC_HourFormat));
  assert_param(IS_ERTC_ASYNCH_PRDIV(ERTC_InitStruct->ERTC_AsynchPrediv));
  assert_param(IS_ERTC_SYNCH_PRDIV(ERTC_InitStruct->ERTC_SynchPrediv));

  /* Disable the write protection for ERTC registers */
  ERTC->WPR = 0xCA;
  ERTC->WPR = 0x53;

  /* Set Initialization mode */
  if (ERTC_EnterInitMode() == ERROR)
  {
    status = ERROR;
  }
  else
  {
    /* Clear ERTC CTRL FMT Bit */
    ERTC->CTRL &= ((uint32_t)~(ERTC_CTRL_HFM));
    /* Set RTC_CR register */
    ERTC->CTRL |=  ((uint32_t)(ERTC_InitStruct->ERTC_HourFormat));

    /* Configure the ERTC PSC */
    ERTC->PSC = (uint32_t)(ERTC_InitStruct->ERTC_SynchPrediv);
    ERTC->PSC |= (uint32_t)(ERTC_InitStruct->ERTC_AsynchPrediv << 16);

    /* Exit Initialization mode */
    ERTC_ExitInitMode();

    status = SUCCESS;
  }
  /* Enable the write protection for ERTC registers */
  ERTC->WPR = 0xFF;

  return status;
}

/**
  * @brief  Fills each ERTC_InitStruct member with its default value.
  * @param  ERTC_InitStruct: pointer to a ERTC_InitType structure which will be
  *         initialized.
  * @retval None
  */
void ERTC_StructInit(ERTC_InitType* ERTC_InitStruct)
{
  /* Initialize the ERTC_HourFormat member */
  ERTC_InitStruct->ERTC_HourFormat = ERTC_HourFormat_24;

  /* Initialize the ERTC_AsynchPrediv member */
  ERTC_InitStruct->ERTC_AsynchPrediv = (uint32_t)0x7F;

  /* Initialize the ERTC_SynchPrediv member */
  ERTC_InitStruct->ERTC_SynchPrediv = (uint32_t)0xFF;
}

/**
  * @brief  Enables or disables the ERTC registers write protection.
  * @note   All the ERTC registers are write protected except for RTC_ISR[13:8],
  *         RTC_TAFCR and RTC_BKPxR.
  * @note   Writing a wrong key reactivates the write protection.
  * @note   The protection mechanism is not affected by system reset.
  * @param  NewState: new state of the write protection.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ERTC_WriteProtectionCmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the write protection for ERTC registers */
    ERTC->WPR = 0xFF;
  }
  else
  {
    /* Disable the write protection for ERTC registers */
    ERTC->WPR = 0xCA;
    ERTC->WPR = 0x53;
  }
}

/**
  * @brief  Enters the ERTC Initialization mode.
  * @note   The ERTC Initialization mode is write protected, use the
  *         ERTC_WriteProtectionCmd(DISABLE) before calling this function.
  * @param  None
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: ERTC is in Init mode
  *          - ERROR: ERTC is not in Init mode
  */
ErrorStatus ERTC_EnterInitMode(void)
{
  __IO uint32_t initcounter = 0x00;
  ErrorStatus status = ERROR;
  uint32_t initstatus = 0x00;

  /* Check if the Initialization mode is set */
  if ((ERTC->ISTS & ERTC_ISTS_INITF) == (uint32_t)RESET)
  {
    /* Set the Initialization mode */
    ERTC->ISTS = (uint32_t)ERTC_INIT_MASK;

    /* Wait till ERTC is in INIT state and if Time out is reached exit */
    do
    {
      initstatus = ERTC->ISTS & ERTC_ISTS_INITF;
      initcounter++;
    } while((initcounter != INITMODE_TMROUT) && (initstatus == 0x00));

