RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_ertc.c
    if ((ERTC->ISTS & ERTC_ISTS_INITF) != RESET)
    {
      status = SUCCESS;
    }
    else
    {
      status = ERROR;
    }
  }
  else
  {
    status = SUCCESS;
  }

  return (status);
}

/**
  * @brief  Exits the ERTC Initialization mode.
  * @note   When the initialization sequence is complete, the calendar restarts
  *         counting after 4 RTCCLK cycles.
  * @note   The ERTC Initialization mode is write protected, use the
  *         ERTC_WriteProtectionCmd(DISABLE) before calling this function.
  * @param  None
  * @retval None
  */
void ERTC_ExitInitMode(void)
{
  /* Exit Initialization mode */
  ERTC->ISTS &= (uint32_t)~ERTC_ISTS_INITM;
}

/**
  * @brief  Waits until the ERTC Time and Date registers (RTC_TR and RTC_DR) are
  *         synchronized with ERTC APB clock.
  * @note   The ERTC Resynchronization mode is write protected, use the
  *         ERTC_WriteProtectionCmd(DISABLE) before calling this function.
  * @note   To read the calendar through the shadow registers after Calendar
  *         initialization, calendar update or after wakeup from low power modes
  *         the software must first clear the RSF flag.
  *         The software must then wait until it is set again before reading
  *         the calendar, which means that the calendar registers have been
  *         correctly copied into the RTC_TR and RTC_DR shadow registers.
  * @param  None
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: ERTC registers are synchronised
  *          - ERROR: ERTC registers are not synchronised
  */
ErrorStatus ERTC_WaitForSynchro(void)
{
  __IO uint32_t synchrocounter = 0;
  ErrorStatus status = ERROR;
  uint32_t synchrostatus = 0x00;

  /* Disable the write protection for ERTC registers */
  ERTC->WPR = 0xCA;
  ERTC->WPR = 0x53;

  /* Clear RSF flag */
  ERTC->ISTS &= (uint32_t)ERTC_RSF_MASK;

  /* Wait the registers to be synchronised */
  do
  {
    synchrostatus = ERTC->ISTS & ERTC_ISTS_RSF;
    synchrocounter++;
  } while((synchrocounter != SYNCHRO_TMROUT) && (synchrostatus == 0x00));

  if ((ERTC->ISTS & ERTC_ISTS_RSF) != RESET)
  {
    status = SUCCESS;
  }
  else
  {
    status = ERROR;
  }

  /* Enable the write protection for ERTC registers */
  ERTC->WPR = 0xFF;

  return (status);
}

/**
  * @brief  Enables or disables the ERTC reference clock detection.
  * @param  NewState: new state of the ERTC reference clock.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: ERTC reference clock detection is enabled
  *          - ERROR: ERTC reference clock detection is disabled
  */
ErrorStatus ERTC_RefClockCmd(FunctionalState NewState)
{
  ErrorStatus status = ERROR;

  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  /* Disable the write protection for ERTC registers */
  ERTC->WPR = 0xCA;
  ERTC->WPR = 0x53;

  /* Set Initialization mode */
  if (ERTC_EnterInitMode() == ERROR)
  {
    status = ERROR;
  }
  else
  {
    if (NewState != DISABLE)
    {
      /* Enable the ERTC reference clock detection */
      ERTC->CTRL |= ERTC_CTRL_RFCKON;
    }
    else
    {
      /* Disable the ERTC reference clock detection */
      ERTC->CTRL &= ~ERTC_CTRL_RFCKON;
    }
    /* Exit Initialization mode */
    ERTC_ExitInitMode();

    status = SUCCESS;
  }

  /* Enable the write protection for ERTC registers */
  ERTC->WPR = 0xFF;

  return status;
}

/**
  * @brief  Enables or Disables the Bypass Shadow feature.
  * @note   When the Bypass Shadow is enabled the calendar value are taken
  *         directly from the Calendar counter.
  * @param  NewState: new state of the Bypass Shadow feature.
  *         This parameter can be: ENABLE or DISABLE.
  * @retval None
*/
void ERTC_BypassShadowCmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  /* Disable the write protection for ERTC registers */
  ERTC->WPR = 0xCA;
  ERTC->WPR = 0x53;

  if (NewState != DISABLE)
  {
    /* Set the BYPSHAD bit */
    ERTC->CTRL |= (uint8_t)ERTC_CTRL_BYPSHDW;
  }
  else
  {
    /* Reset the BYPSHAD bit */
    ERTC->CTRL &= (uint8_t)~ERTC_CTRL_BYPSHDW;
  }

  /* Enable the write protection for ERTC registers */
  ERTC->WPR = 0xFF;
}

/**
  * @}
  */

/** @defgroup RTC_Group2 Time and Date configuration functions
 *  @brief   Time and Date configuration functions
 *
@verbatim
 ===============================================================================
                 ##### Time and Date configuration functions #####
 ===============================================================================

 [..] This section provide functions allowing to program and read the ERTC Calendar
      (Time and Date).

@endverbatim
  * @{
  */

/**
  * @brief  Set the ERTC current time.
  * @param  ERTC_Format: specifies the format of the entered parameters.
  *          This parameter can be  one of the following values:
  *            @arg ERTC_Format_BIN:  Binary data format
  *            @arg ERTC_Format_BCD:  BCD data format
  * @param  ERTC_TimeStruct: pointer to a ERTC_TimeType structure that contains
  *                        the time configuration information for the ERTC.
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: ERTC Time register is configured
  *          - ERROR: ERTC Time register is not configured
  */
ErrorStatus ERTC_SetTimeValue(uint32_t ERTC_Format, ERTC_TimeType* ERTC_TimeStruct)
{
  uint32_t tmpreg = 0;
  ErrorStatus status = ERROR;

  /* Check the parameters */
  assert_param(IS_ERTC_FORMAT(ERTC_Format));

  if (ERTC_Format == ERTC_Format_BIN)
  {
    if ((ERTC->CTRL & ERTC_CTRL_HFM) != (uint32_t)RESET)
    {
      assert_param(IS_ERTC_HOUR12(ERTC_TimeStruct->ERTC_Hours));
      assert_param(IS_ERTC_H12(ERTC_TimeStruct->ERTC_AMPM));
    }
    else
    {
      ERTC_TimeStruct->ERTC_AMPM = 0x00;
      assert_param(IS_ERTC_HOUR24(ERTC_TimeStruct->ERTC_Hours));
    }
    assert_param(IS_ERTC_MINUTES(ERTC_TimeStruct->ERTC_Minutes));
    assert_param(IS_ERTC_SECONDS(ERTC_TimeStruct->ERTC_Seconds));
  }
  else
  {
    if ((ERTC->CTRL & ERTC_CTRL_HFM) != (uint32_t)RESET)
    {
      tmpreg = ERTC_Bcd2ToByte(ERTC_TimeStruct->ERTC_Hours);
      assert_param(IS_ERTC_HOUR12(tmpreg));
      assert_param(IS_ERTC_H12(ERTC_TimeStruct->ERTC_AMPM));
    }
    else
    {
      ERTC_TimeStruct->ERTC_AMPM = 0x00;
      assert_param(IS_ERTC_HOUR24(ERTC_Bcd2ToByte(ERTC_TimeStruct->ERTC_Hours)));
    }
    assert_param(IS_ERTC_MINUTES(ERTC_Bcd2ToByte(ERTC_TimeStruct->ERTC_Minutes)));
    assert_param(IS_ERTC_SECONDS(ERTC_Bcd2ToByte(ERTC_TimeStruct->ERTC_Seconds)));
  }

  /* Check the input parameters format */
  if (ERTC_Format != ERTC_Format_BIN)
  {
    tmpreg = (((uint32_t)(ERTC_TimeStruct->ERTC_Hours) << 16) | \
             ((uint32_t)(ERTC_TimeStruct->ERTC_Minutes) << 8) | \
             ((uint32_t)ERTC_TimeStruct->ERTC_Seconds) | \
             ((uint32_t)(ERTC_TimeStruct->ERTC_AMPM) << 16));
  }
  else
  {
    tmpreg = (uint32_t)(((uint32_t)ERTC_ByteToBcd2(ERTC_TimeStruct->ERTC_Hours) << 16) | \
                   ((uint32_t)ERTC_ByteToBcd2(ERTC_TimeStruct->ERTC_Minutes) << 8) | \
                   ((uint32_t)ERTC_ByteToBcd2(ERTC_TimeStruct->ERTC_Seconds)) | \
                   (((uint32_t)ERTC_TimeStruct->ERTC_AMPM) << 16));
  }

  /* Disable the write protection for ERTC registers */
  ERTC->WPR = 0xCA;
  ERTC->WPR = 0x53;

  /* Set Initialization mode */
  if (ERTC_EnterInitMode() == ERROR)
  {
    status = ERROR;
  }
  else
  {
    /* Set the RTC_TR register */
    ERTC->TIME = (uint32_t)(tmpreg & ERTC_TIME_RESERVED_MASK);

    /* Exit Initialization mode */
    ERTC_ExitInitMode();

