RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_ertc.c
    /* If  ERTC_CTRL_BYPSHDW bit = 0, wait for synchro else this check is not needed */
    if ((ERTC->CTRL & ERTC_CTRL_BYPSHDW) == RESET)
    {
    if(ERTC_WaitForSynchro() == ERROR)
    {
      status = ERROR;
    }
    else
    {
      status = SUCCESS;
    }
  }
    else
    {
      status = SUCCESS;
    }
  }
  /* Enable the write protection for ERTC registers */
  ERTC->WPR = 0xFF;

  return status;
}

/**
  * @brief  Fills each ERTC_TimeStruct member with its default value
  *         (Time = 00h:00min:00sec).
  * @param  ERTC_TimeStruct: pointer to a ERTC_TimeType structure which will be
  *         initialized.
  * @retval None
  */
void ERTC_TimeStructInit(ERTC_TimeType* ERTC_TimeStruct)
{
  /* Time = 00h:00min:00sec */
  ERTC_TimeStruct->ERTC_AMPM = ERTC_H12_AM;
  ERTC_TimeStruct->ERTC_Hours = 0;
  ERTC_TimeStruct->ERTC_Minutes = 0;
  ERTC_TimeStruct->ERTC_Seconds = 0;
}

/**
  * @brief  Get the ERTC current Time.
  * @param  ERTC_Format: specifies the format of the returned parameters.
  *          This parameter can be  one of the following values:
  *            @arg ERTC_Format_BIN:  Binary data format
  *            @arg ERTC_Format_BCD:  BCD data format
  * @param  ERTC_TimeStruct: pointer to a ERTC_TimeType structure that will
  *                        contain the returned current time configuration.
  * @retval None
  */
void ERTC_GetTimeValue(uint32_t ERTC_Format, ERTC_TimeType* ERTC_TimeStruct)
{
  uint32_t tmpreg = 0;

  /* Check the parameters */
  assert_param(IS_ERTC_FORMAT(ERTC_Format));

  /* Get the RTC_TR register */
  tmpreg = (uint32_t)(ERTC->TIME & ERTC_TIME_RESERVED_MASK);

  /* Fill the structure fields with the read parameters */
  ERTC_TimeStruct->ERTC_Hours = (uint8_t)((tmpreg & (ERTC_TIME_HT | ERTC_TIME_HU)) >> 16);
  ERTC_TimeStruct->ERTC_Minutes = (uint8_t)((tmpreg & (ERTC_TIME_MT | ERTC_TIME_MU)) >>8);
  ERTC_TimeStruct->ERTC_Seconds = (uint8_t)(tmpreg & (ERTC_TIME_ST | ERTC_TIME_SU));
  ERTC_TimeStruct->ERTC_AMPM = (uint8_t)((tmpreg & (ERTC_TIME_AMPM)) >> 16);

  /* Check the input parameters format */
  if (ERTC_Format == ERTC_Format_BIN)
  {
    /* Convert the structure parameters to Binary format */
    ERTC_TimeStruct->ERTC_Hours = (uint8_t)ERTC_Bcd2ToByte(ERTC_TimeStruct->ERTC_Hours);
    ERTC_TimeStruct->ERTC_Minutes = (uint8_t)ERTC_Bcd2ToByte(ERTC_TimeStruct->ERTC_Minutes);
    ERTC_TimeStruct->ERTC_Seconds = (uint8_t)ERTC_Bcd2ToByte(ERTC_TimeStruct->ERTC_Seconds);
  }
}

/**
  * @brief  Gets the ERTC current Calendar Sub seconds value.
  * @note   This function freeze the Time and Date registers after reading the
  *         SBSR register.
  * @param  None
  * @retval ERTC current Calendar Sub seconds value.
  */
uint32_t ERTC_GetSubSecondValue(void)
{
  uint32_t tmpreg = 0;

  /* Get sub seconds values from the correspondent registers*/
  tmpreg = (uint32_t)(ERTC->SBSR);

  /* Read DATE register to unfroze calendar registers */
  (void) (ERTC->DATE);

  return (tmpreg);
}

/**
  * @brief  Set the ERTC current date.
  * @param  ERTC_Format: specifies the format of the entered parameters.
  *          This parameter can be  one of the following values:
  *            @arg ERTC_Format_BIN:  Binary data format
  *            @arg ERTC_Format_BCD:  BCD data format
  * @param  ERTC_DateStruct: pointer to a ERTC_DateType structure that contains
  *                         the date configuration information for the ERTC.
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: ERTC Date register is configured
  *          - ERROR: ERTC Date register is not configured
  */
ErrorStatus ERTC_SetDateValue(uint32_t ERTC_Format, ERTC_DateType* ERTC_DateStruct)
{
  uint32_t tmpreg = 0;
  ErrorStatus status = ERROR;

  /* Check the parameters */
  assert_param(IS_ERTC_FORMAT(ERTC_Format));

  if ((ERTC_Format == ERTC_Format_BIN) && ((ERTC_DateStruct->ERTC_Month & 0x10) == 0x10))
  {
    ERTC_DateStruct->ERTC_Month = (ERTC_DateStruct->ERTC_Month & (uint32_t)~(0x10)) + 0x0A;
  }
  if (ERTC_Format == ERTC_Format_BIN)
  {
    assert_param(IS_ERTC_YEAR(ERTC_DateStruct->ERTC_Year));
    assert_param(IS_ERTC_MONTH(ERTC_DateStruct->ERTC_Month));
    assert_param(IS_ERTC_DATE(ERTC_DateStruct->ERTC_Date));
  }
  else
  {
    assert_param(IS_ERTC_YEAR(ERTC_Bcd2ToByte(ERTC_DateStruct->ERTC_Year)));
    tmpreg = ERTC_Bcd2ToByte(ERTC_DateStruct->ERTC_Month);
    assert_param(IS_ERTC_MONTH(tmpreg));
    tmpreg = ERTC_Bcd2ToByte(ERTC_DateStruct->ERTC_Date);
    assert_param(IS_ERTC_DATE(tmpreg));
  }
  assert_param(IS_ERTC_WEEK(ERTC_DateStruct->ERTC_WeekDay));

  /* Check the input parameters format */
  if (ERTC_Format != ERTC_Format_BIN)
  {
    tmpreg = ((((uint32_t)ERTC_DateStruct->ERTC_Year) << 16) | \
              (((uint32_t)ERTC_DateStruct->ERTC_Month) << 8) | \
              ((uint32_t)ERTC_DateStruct->ERTC_Date) | \
              (((uint32_t)ERTC_DateStruct->ERTC_WeekDay) << 13));
  }
  else
  {
    tmpreg = (((uint32_t)ERTC_ByteToBcd2(ERTC_DateStruct->ERTC_Year) << 16) | \
              ((uint32_t)ERTC_ByteToBcd2(ERTC_DateStruct->ERTC_Month) << 8) | \
              ((uint32_t)ERTC_ByteToBcd2(ERTC_DateStruct->ERTC_Date)) | \
              ((uint32_t)ERTC_DateStruct->ERTC_WeekDay << 13));
  }

  /* Disable the write protection for ERTC registers */
  ERTC->WPR = 0xCA;
  ERTC->WPR = 0x53;

  /* Set Initialization mode */
  if (ERTC_EnterInitMode() == ERROR)
  {
    status = ERROR;
  }
  else
  {
    /* Set the RTC_DR register */
    ERTC->DATE = (uint32_t)(tmpreg & ERTC_DATE_RESERVED_MASK);

    /* Exit Initialization mode */
    ERTC_ExitInitMode();

    /* If  ERTC_CTRL_BYPSHDW bit = 0, wait for synchro else this check is not needed */
    if ((ERTC->CTRL & ERTC_CTRL_BYPSHDW) == RESET)
    {
    if(ERTC_WaitForSynchro() == ERROR)
    {
      status = ERROR;
    }
    else
    {
      status = SUCCESS;
    }
  }
    else
    {
      status = SUCCESS;
    }
  }
  /* Enable the write protection for ERTC registers */
  ERTC->WPR = 0xFF;

  return status;
}

/**
  * @brief  Fills each ERTC_DateStruct member with its default value
  *         (Monday, January 01 xx00).
  * @param  ERTC_DateStruct: pointer to a ERTC_DateType structure which will be
  *         initialized.
  * @retval None
  */
void ERTC_DateStructInit(ERTC_DateType* ERTC_DateStruct)
{
  /* Monday, January 01 xx00 */
  ERTC_DateStruct->ERTC_WeekDay = ERTC_Week_MON;
  ERTC_DateStruct->ERTC_Date = 1;
  ERTC_DateStruct->ERTC_Month = ERTC_Month_JAN;
  ERTC_DateStruct->ERTC_Year = 0;
}

/**
  * @brief  Get the ERTC current date.
  * @param  ERTC_Format: specifies the format of the returned parameters.
  *          This parameter can be one of the following values:
  *            @arg ERTC_Format_BIN: Binary data format
  *            @arg ERTC_Format_BCD: BCD data format
  * @param ERTC_DateStruct: pointer to a ERTC_DateType structure that will
  *                        contain the returned current date configuration.
  * @retval None
  */
void ERTC_GetDateValue(uint32_t ERTC_Format, ERTC_DateType* ERTC_DateStruct)
{
  uint32_t tmpreg = 0;

  /* Check the parameters */
  assert_param(IS_ERTC_FORMAT(ERTC_Format));

  /* Get the RTC_TR register */
  tmpreg = (uint32_t)(ERTC->DATE & ERTC_DATE_RESERVED_MASK);

  /* Fill the structure fields with the read parameters */
  ERTC_DateStruct->ERTC_Year = (uint8_t)((tmpreg & (ERTC_DATE_YT | ERTC_DATE_YU)) >> 16);
  ERTC_DateStruct->ERTC_Month = (uint8_t)((tmpreg & (ERTC_DATE_MT | ERTC_DATE_MU)) >> 8);
  ERTC_DateStruct->ERTC_Date = (uint8_t)(tmpreg & (ERTC_DATE_DT | ERTC_DATE_DU));
  ERTC_DateStruct->ERTC_WeekDay = (uint8_t)((tmpreg & (ERTC_DATE_WK)) >> 13);

  /* Check the input parameters format */
  if (ERTC_Format == ERTC_Format_BIN)
  {
    /* Convert the structure parameters to Binary format */
    ERTC_DateStruct->ERTC_Year = (uint8_t)ERTC_Bcd2ToByte(ERTC_DateStruct->ERTC_Year);
    ERTC_DateStruct->ERTC_Month = (uint8_t)ERTC_Bcd2ToByte(ERTC_DateStruct->ERTC_Month);
    ERTC_DateStruct->ERTC_Date = (uint8_t)ERTC_Bcd2ToByte(ERTC_DateStruct->ERTC_Date);
  }
}

/**
  * @}
  */

/** @defgroup RTC_Group3 Alarms configuration functions
 *  @brief   Alarms (Alarm A and Alarm B) configuration functions
 *
@verbatim
 ===============================================================================
         ##### Alarms A and B configuration functions #####
 ===============================================================================

