RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_ertc.c
 [..] This section provide functions allowing to program and read the ERTC Alarms.

@endverbatim
  * @{
  */

/**
  * @brief  Set the specified ERTC Alarm.
  * @note   The Alarm register can only be written when the corresponding Alarm
  *         is disabled (Use the ERTC_AlarmCmd(DISABLE)).
  * @param  ERTC_Format: specifies the format of the returned parameters.
  *          This parameter can be one of the following values:
  *            @arg ERTC_Format_BIN: Binary data format
  *            @arg ERTC_Format_BCD: BCD data format
  * @param  ERTC_Alarm: specifies the alarm to be configured.
  *          This parameter can be one of the following values:
  *            @arg ERTC_AlA: to select Alarm A
  *            @arg ERTC_AlB: to select Alarm B
  * @param  ERTC_AlarmStruct: pointer to a ERTC_AlarmType structure that
  *                          contains the alarm configuration parameters.
  * @retval None
  */
void ERTC_SetAlarmValue(uint32_t ERTC_Format, uint32_t ERTC_Alarm, ERTC_AlarmType* ERTC_AlarmStruct)
{
  uint32_t tmpreg = 0;

  /* Check the parameters */
  assert_param(IS_ERTC_FORMAT(ERTC_Format));
  assert_param(IS_ERTC_ALARM(ERTC_Alarm));
  assert_param(IS_ALARM_MASK(ERTC_AlarmStruct->ERTC_AlarmMask));
  assert_param(IS_ERTC_ALARM_DATE_WEEK_SEL(ERTC_AlarmStruct->ERTC_AlarmDateWeekSel));

  if (ERTC_Format == ERTC_Format_BIN)
  {
    if ((ERTC->CTRL & ERTC_CTRL_HFM) != (uint32_t)RESET)
    {
      assert_param(IS_ERTC_HOUR12(ERTC_AlarmStruct->ERTC_AlarmTime.ERTC_Hours));
      assert_param(IS_ERTC_H12(ERTC_AlarmStruct->ERTC_AlarmTime.ERTC_AMPM));
    }
    else
    {
      ERTC_AlarmStruct->ERTC_AlarmTime.ERTC_AMPM = 0x00;
      assert_param(IS_ERTC_HOUR24(ERTC_AlarmStruct->ERTC_AlarmTime.ERTC_Hours));
    }
    assert_param(IS_ERTC_MINUTES(ERTC_AlarmStruct->ERTC_AlarmTime.ERTC_Minutes));
    assert_param(IS_ERTC_SECONDS(ERTC_AlarmStruct->ERTC_AlarmTime.ERTC_Seconds));

    if(ERTC_AlarmStruct->ERTC_AlarmDateWeekSel == ERTC_AlarmDateWeekSel_Date)
    {
      assert_param(IS_ERTC_ALARM_DATE_WEEK_DATE(ERTC_AlarmStruct->ERTC_AlarmDateWeek));
    }
    else
    {
      assert_param(IS_ERTC_ALARM_DATE_WEEK_WEEK(ERTC_AlarmStruct->ERTC_AlarmDateWeek));
    }
  }
  else
  {
    if ((ERTC->CTRL & ERTC_CTRL_HFM) != (uint32_t)RESET)
    {
      tmpreg = ERTC_Bcd2ToByte(ERTC_AlarmStruct->ERTC_AlarmTime.ERTC_Hours);
      assert_param(IS_ERTC_HOUR12(tmpreg));
      assert_param(IS_ERTC_H12(ERTC_AlarmStruct->ERTC_AlarmTime.ERTC_AMPM));
    }
    else
    {
      ERTC_AlarmStruct->ERTC_AlarmTime.ERTC_AMPM = 0x00;
      assert_param(IS_ERTC_HOUR24(ERTC_Bcd2ToByte(ERTC_AlarmStruct->ERTC_AlarmTime.ERTC_Hours)));
    }

    assert_param(IS_ERTC_MINUTES(ERTC_Bcd2ToByte(ERTC_AlarmStruct->ERTC_AlarmTime.ERTC_Minutes)));
    assert_param(IS_ERTC_SECONDS(ERTC_Bcd2ToByte(ERTC_AlarmStruct->ERTC_AlarmTime.ERTC_Seconds)));

    if(ERTC_AlarmStruct->ERTC_AlarmDateWeekSel == ERTC_AlarmDateWeekSel_Date)
    {
      tmpreg = ERTC_Bcd2ToByte(ERTC_AlarmStruct->ERTC_AlarmDateWeek);
      assert_param(IS_ERTC_ALARM_DATE_WEEK_DATE(tmpreg));
    }
    else
    {
      tmpreg = ERTC_Bcd2ToByte(ERTC_AlarmStruct->ERTC_AlarmDateWeek);
      assert_param(IS_ERTC_ALARM_DATE_WEEK_WEEK(tmpreg));
    }
  }

  /* Check the input parameters format */
  if (ERTC_Format != ERTC_Format_BIN)
  {
    tmpreg = (((uint32_t)(ERTC_AlarmStruct->ERTC_AlarmTime.ERTC_Hours) << 16) | \
              ((uint32_t)(ERTC_AlarmStruct->ERTC_AlarmTime.ERTC_Minutes) << 8) | \
              ((uint32_t)ERTC_AlarmStruct->ERTC_AlarmTime.ERTC_Seconds) | \
              ((uint32_t)(ERTC_AlarmStruct->ERTC_AlarmTime.ERTC_AMPM) << 16) | \
              ((uint32_t)(ERTC_AlarmStruct->ERTC_AlarmDateWeek) << 24) | \
              ((uint32_t)ERTC_AlarmStruct->ERTC_AlarmDateWeekSel) | \
              ((uint32_t)ERTC_AlarmStruct->ERTC_AlarmMask));
  }
  else
  {
    tmpreg = (((uint32_t)ERTC_ByteToBcd2(ERTC_AlarmStruct->ERTC_AlarmTime.ERTC_Hours) << 16) | \
              ((uint32_t)ERTC_ByteToBcd2(ERTC_AlarmStruct->ERTC_AlarmTime.ERTC_Minutes) << 8) | \
              ((uint32_t)ERTC_ByteToBcd2(ERTC_AlarmStruct->ERTC_AlarmTime.ERTC_Seconds)) | \
              ((uint32_t)(ERTC_AlarmStruct->ERTC_AlarmTime.ERTC_AMPM) << 16) | \
              ((uint32_t)ERTC_ByteToBcd2(ERTC_AlarmStruct->ERTC_AlarmDateWeek) << 24) | \
              ((uint32_t)ERTC_AlarmStruct->ERTC_AlarmDateWeekSel) | \
              ((uint32_t)ERTC_AlarmStruct->ERTC_AlarmMask));
  }

  /* Disable the write protection for ERTC registers */
  ERTC->WPR = 0xCA;
  ERTC->WPR = 0x53;

  /* Configure the Alarm register */
  if (ERTC_Alarm == ERTC_AlA)
  {
    ERTC->ALA = (uint32_t)tmpreg;
  }
  else
  {
    ERTC->ALB = (uint32_t)tmpreg;
  }

  /* Enable the write protection for ERTC registers */
  ERTC->WPR = 0xFF;
}

/**
  * @brief  Fills each ERTC_AlarmStruct member with its default value
  *         (Time = 00h:00mn:00sec / Date = 1st day of the month/Mask =
  *         all fields are masked).
  * @param  ERTC_AlarmStruct: pointer to a @ref ERTC_AlarmType structure which
  *         will be initialized.
  * @retval None
  */
void ERTC_AlarmStructInit(ERTC_AlarmType* ERTC_AlarmStruct)
{
  /* Alarm Time Settings : Time = 00h:00mn:00sec */
  ERTC_AlarmStruct->ERTC_AlarmTime.ERTC_AMPM = ERTC_H12_AM;
  ERTC_AlarmStruct->ERTC_AlarmTime.ERTC_Hours = 0;
  ERTC_AlarmStruct->ERTC_AlarmTime.ERTC_Minutes = 0;
  ERTC_AlarmStruct->ERTC_AlarmTime.ERTC_Seconds = 0;

  /* Alarm Date Settings : Date = 1st day of the month */
  ERTC_AlarmStruct->ERTC_AlarmDateWeekSel = ERTC_AlarmDateWeekSel_Date;
  ERTC_AlarmStruct->ERTC_AlarmDateWeek = 1;

  /* Alarm Masks Settings : Mask =  all fields are not masked */
  ERTC_AlarmStruct->ERTC_AlarmMask = ERTC_AlarmMask_None;
}

/**
  * @brief  Get the ERTC Alarm value and masks.
  * @param  ERTC_Format: specifies the format of the output parameters.
  *          This parameter can be one of the following values:
  *            @arg ERTC_Format_BIN: Binary data format
  *            @arg ERTC_Format_BCD: BCD data format
  * @param  ERTC_Alarm: specifies the alarm to be read.
  *          This parameter can be one of the following values:
  *            @arg ERTC_AlA: to select Alarm A
  *            @arg ERTC_AlB: to select Alarm B
  * @param  ERTC_AlarmStruct: pointer to a ERTC_AlarmType structure that will
  *                          contains the output alarm configuration values.
  * @retval None
  */
void ERTC_GetAlarmValue(uint32_t ERTC_Format, uint32_t ERTC_Alarm, ERTC_AlarmType* ERTC_AlarmStruct)
{
  uint32_t tmpreg = 0;

  /* Check the parameters */
  assert_param(IS_ERTC_FORMAT(ERTC_Format));
  assert_param(IS_ERTC_ALARM(ERTC_Alarm));

  /* Get the RTC_ALRMxR register */
  if (ERTC_Alarm == ERTC_AlA)
  {
    tmpreg = (uint32_t)(ERTC->ALA);
  }
  else
  {
    tmpreg = (uint32_t)(ERTC->ALB);
  }

  /* Fill the structure with the read parameters */
  ERTC_AlarmStruct->ERTC_AlarmTime.ERTC_Hours = (uint32_t)((tmpreg & (ERTC_ALA_HT | \
                                                     ERTC_ALA_HU)) >> 16);
  ERTC_AlarmStruct->ERTC_AlarmTime.ERTC_Minutes = (uint32_t)((tmpreg & (ERTC_ALA_MT | \
                                                     ERTC_ALA_MU)) >> 8);
  ERTC_AlarmStruct->ERTC_AlarmTime.ERTC_Seconds = (uint32_t)(tmpreg & (ERTC_ALA_ST | \
                                                     ERTC_ALA_SU));
  ERTC_AlarmStruct->ERTC_AlarmTime.ERTC_AMPM = (uint32_t)((tmpreg & ERTC_ALA_AMPM) >> 16);
  ERTC_AlarmStruct->ERTC_AlarmDateWeek = (uint32_t)((tmpreg & (ERTC_ALA_DT | ERTC_ALA_DU)) >> 24);
  ERTC_AlarmStruct->ERTC_AlarmDateWeekSel = (uint32_t)(tmpreg & ERTC_ALA_WKSEL);
  ERTC_AlarmStruct->ERTC_AlarmMask = (uint32_t)(tmpreg & ERTC_AlarmMask_All);

  if (ERTC_Format == ERTC_Format_BIN)
  {
    ERTC_AlarmStruct->ERTC_AlarmTime.ERTC_Hours = ERTC_Bcd2ToByte(ERTC_AlarmStruct-> \
                                                        ERTC_AlarmTime.ERTC_Hours);
    ERTC_AlarmStruct->ERTC_AlarmTime.ERTC_Minutes = ERTC_Bcd2ToByte(ERTC_AlarmStruct-> \
                                                        ERTC_AlarmTime.ERTC_Minutes);
    ERTC_AlarmStruct->ERTC_AlarmTime.ERTC_Seconds = ERTC_Bcd2ToByte(ERTC_AlarmStruct-> \
                                                        ERTC_AlarmTime.ERTC_Seconds);
    ERTC_AlarmStruct->ERTC_AlarmDateWeek = ERTC_Bcd2ToByte(ERTC_AlarmStruct->ERTC_AlarmDateWeek);
  }
}

/**
  * @brief  Enables or disables the specified ERTC Alarm.
  * @param  ERTC_Alarm: specifies the alarm to be configured.
  *          This parameter can be any combination of the following values:
  *            @arg ERTC_AlA: to select Alarm A
  *            @arg ERTC_AlB: to select Alarm B
  * @param  NewState: new state of the specified alarm.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: ERTC Alarm is enabled/disabled
  *          - ERROR: ERTC Alarm is not enabled/disabled
  */
ErrorStatus ERTC_AlarmCmd(uint32_t ERTC_Alarm, FunctionalState NewState)
{
  __IO uint32_t alarmcounter = 0x00;
  uint32_t alarmstatus = 0x00;
  ErrorStatus status = ERROR;

  /* Check the parameters */
  assert_param(IS_ERTC_CMD_ALARM(ERTC_Alarm));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  /* Disable the write protection for ERTC registers */
  ERTC->WPR = 0xCA;
  ERTC->WPR = 0x53;

  /* Configure the Alarm state */
  if (NewState != DISABLE)
  {
    ERTC->CTRL |= (uint32_t)ERTC_Alarm;

    status = SUCCESS;
  }
  else
  {
    /* Disable the Alarm in RTC_CR register */
    ERTC->CTRL &= (uint32_t)~ERTC_Alarm;

