RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_ertc.c
    /* Wait till ERTC ALRxWF flag is set and if Time out is reached exit */
    do
    {
      alarmstatus = ERTC->ISTS & (ERTC_Alarm >> 8);
      alarmcounter++;
    } while((alarmcounter != INITMODE_TMROUT) && (alarmstatus == 0x00));

    if ((ERTC->ISTS & (ERTC_Alarm >> 8)) == RESET)
    {
      status = ERROR;
    }
    else
    {
      status = SUCCESS;
    }
  }

  /* Enable the write protection for ERTC registers */
  ERTC->WPR = 0xFF;

  return status;
}

/**
  * @brief  Configure the ERTC AlarmA/B Sub seconds value and mask.*
  * @note   This function is performed only when the Alarm is disabled.
  * @param  ERTC_Alarm: specifies the alarm to be configured.
  *   This parameter can be one of the following values:
  *     @arg ERTC_AlA: to select Alarm A
  *     @arg ERTC_AlB: to select Alarm B
  * @param  ERTC_AlarmSubSecondValue: specifies the Sub seconds value.
  *   This parameter can be a value from 0 to 0x00007FFF.
  * @param  ERTC_AlarmSubSecondMask:  specifies the Sub seconds Mask.
  *   This parameter can be any combination of the following values:
  *     @arg ERTC_AlarmSubSecondMask_All    : All Alarm SS fields are masked.
  *                                          There is no comparison on sub seconds for Alarm.
  *     @arg ERTC_AlarmSubSecondMask_SBS14_1 : SS[14:1] are don't care in Alarm comparison.
  *                                          Only SS[0] is compared
  *     @arg ERTC_AlarmSubSecondMask_SBS14_2 : SS[14:2] are don't care in Alarm comparison.
  *                                          Only SS[1:0] are compared
  *     @arg ERTC_AlarmSubSecondMask_SBS14_3 : SS[14:3] are don't care in Alarm comparison.
  *                                          Only SS[2:0] are compared
  *     @arg ERTC_AlarmSubSecondMask_SBS14_4 : SS[14:4] are don't care in Alarm comparison.
  *                                          Only SS[3:0] are compared
  *     @arg ERTC_AlarmSubSecondMask_SBS14_5 : SS[14:5] are don't care in Alarm comparison.
  *                                          Only SS[4:0] are compared
  *     @arg ERTC_AlarmSubSecondMask_SBS14_6 : SS[14:6] are don't care in Alarm comparison.
  *                                          Only SS[5:0] are compared
  *     @arg ERTC_AlarmSubSecondMask_SBS14_7 : SS[14:7] are don't care in Alarm comparison.
  *                                          Only SS[6:0] are compared
  *     @arg ERTC_AlarmSubSecondMask_SBS14_8 : SS[14:8] are don't care in Alarm comparison.
  *                                          Only SS[7:0] are compared
  *     @arg ERTC_AlarmSubSecondMask_SBS14_9 : SS[14:9] are don't care in Alarm comparison.
  *                                          Only SS[8:0] are compared
  *     @arg ERTC_AlarmSubSecondMask_SBS14_10: SS[14:10] are don't care in Alarm comparison.
  *                                          Only SS[9:0] are compared
  *     @arg ERTC_AlarmSubSecondMask_SBS14_11: SS[14:11] are don't care in Alarm comparison.
  *                                          Only SS[10:0] are compared
  *     @arg ERTC_AlarmSubSecondMask_SBS14_12: SS[14:12] are don't care in Alarm comparison.
  *                                          Only SS[11:0] are compared
  *     @arg ERTC_AlarmSubSecondMask_SBS14_13: SS[14:13] are don't care in Alarm comparison.
  *                                          Only SS[12:0] are compared
  *     @arg ERTC_AlarmSubSecondMask_SBS14   : SS[14] is don't care in Alarm comparison.
  *                                          Only SS[13:0] are compared
  *     @arg ERTC_AlarmSubSecondMask_None   : SS[14:0] are compared and must match
  *                                          to activate alarm
  * @retval None
  */
void ERTC_AlarmSubSecondConfig(uint32_t ERTC_Alarm, uint32_t ERTC_AlarmSubSecondValue, uint32_t ERTC_AlarmSubSecondMask)
{
  uint32_t tmpreg = 0;

  /* Check the parameters */
  assert_param(IS_ERTC_ALARM(ERTC_Alarm));
  assert_param(IS_ERTC_ALARM_SUB_SECOND_VALUE(ERTC_AlarmSubSecondValue));
  assert_param(IS_ERTC_ALARM_SUB_SECOND_MASK(ERTC_AlarmSubSecondMask));

  /* Disable the write protection for ERTC registers */
  ERTC->WPR = 0xCA;
  ERTC->WPR = 0x53;

  /* Configure the Alarm A or Alarm B Sub Second registers */
  tmpreg = (uint32_t) (uint32_t)(ERTC_AlarmSubSecondValue) | (uint32_t)(ERTC_AlarmSubSecondMask);

  if (ERTC_Alarm == ERTC_AlA)
  {
    /* Configure the Alarm A Sub Second register */
    ERTC->ALASBS = tmpreg;
  }
  else
  {
    /* Configure the Alarm B Sub Second register */
    ERTC->ALBSBS = tmpreg;
  }

  /* Enable the write protection for ERTC registers */
  ERTC->WPR = 0xFF;

}

/**
  * @brief  Gets the ERTC Alarm Sub seconds value.
  * @param  ERTC_Alarm: specifies the alarm to be read.
  *   This parameter can be one of the following values:
  *     @arg ERTC_AlA: to select Alarm A
  *     @arg ERTC_AlB: to select Alarm B
  * @param  None
  * @retval ERTC Alarm Sub seconds value.
  */
uint32_t ERTC_GetAlarmSubSecond(uint32_t ERTC_Alarm)
{
  uint32_t tmpreg = 0;

  /* Get the RTC_ALRMxR register */
  if (ERTC_Alarm == ERTC_AlA)
  {
    tmpreg = (uint32_t)((ERTC->ALASBS) & ERTC_ALASBS_SBS);
  }
  else
  {
    tmpreg = (uint32_t)((ERTC->ALBSBS) & ERTC_ALBSBS_SBS);
  }

  return (tmpreg);
}

/**
  * @}
  */

/** @defgroup RTC_Group4 WakeUp Timer configuration functions
 *  @brief   WakeUp Timer configuration functions
 *
@verbatim
 ===============================================================================
                 ##### WakeUp Timer configuration functions #####
 ===============================================================================

 [..] This section provide functions allowing to program and read the ERTC WakeUp.

@endverbatim
  * @{
  */

/**
  * @brief  Configures the ERTC Wakeup clock source.
  * @note   The WakeUp Clock source can only be changed when the ERTC WakeUp
  *         is disabled (Use the ERTC_WakeUpCmd(DISABLE)).
  * @param  ERTC_WakeUpClock: Wakeup Clock source.
  *          This parameter can be one of the following values:
  *            @arg ERTC_WakeUpClockSelect_RTCCLK_Div16: ERTC Wakeup Counter Clock = RTCCLK/16
  *            @arg ERTC_WakeUpClockSelect_RTCCLK_Div8: ERTC Wakeup Counter Clock = RTCCLK/8
  *            @arg ERTC_WakeUpClockSelect_RTCCLK_Div4: ERTC Wakeup Counter Clock = RTCCLK/4
  *            @arg ERTC_WakeUpClockSelect_RTCCLK_Div2: ERTC Wakeup Counter Clock = RTCCLK/2
  *            @arg ERTC_WakeUpClockSelect_CK_SPRE_16bits: ERTC Wakeup Counter Clock = CK_SPRE
  *            @arg ERTC_WakeUpClockSelect_CK_SPRE_17bits: ERTC Wakeup Counter Clock = CK_SPRE
  * @retval None
  */
void ERTC_WakeUpClockConfig(uint32_t ERTC_WakeUpClock)
{
  /* Check the parameters */
  assert_param(IS_ERTC_WAKEUP_CLOCK_SELECT(ERTC_WakeUpClock));

  /* Disable the write protection for ERTC registers */
  ERTC->WPR = 0xCA;
  ERTC->WPR = 0x53;

  /* Clear the Wakeup Timer clock source bits in CTRL register */
  ERTC->CTRL &= (uint32_t)~ERTC_CTRL_WACKSEL;

  /* Configure the clock source */
  ERTC->CTRL |= (uint32_t)ERTC_WakeUpClock;

