RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_ertc.c
  /* Enable the write protection for ERTC registers */
  ERTC->WPR = 0xFF;
}

/**
  * @brief  Configures the ERTC Wakeup counter.
  * @note   The ERTC WakeUp counter can only be written when the ERTC WakeUp
  *         is disabled (Use the ERTC_WakeUpCmd(DISABLE)).
  * @param  ERTC_WakeUpCounter: specifies the WakeUp counter.
  *          This parameter can be a value from 0x0000 to 0xFFFF.
  * @retval None
  */
void ERTC_SetWakeUpCounter(uint32_t ERTC_WakeUpCounter)
{
  /* Check the parameters */
  assert_param(IS_ERTC_WAKEUP_COUNTER(ERTC_WakeUpCounter));

  /* Disable the write protection for ERTC registers */
  ERTC->WPR = 0xCA;
  ERTC->WPR = 0x53;

  /* Configure the Wakeup Timer counter */
  ERTC->WATR = (uint32_t)ERTC_WakeUpCounter;

  /* Enable the write protection for ERTC registers */
  ERTC->WPR = 0xFF;
}

/**
  * @brief  Returns the ERTC WakeUp timer counter value.
  * @param  None
  * @retval The ERTC WakeUp Counter value.
  */
uint32_t ERTC_GetWakeUpCounter(void)
{
  /* Get the counter value */
  return ((uint32_t)(ERTC->WATR & ERTC_WATR_WAREV));
}

/**
  * @brief  Enables or Disables the ERTC WakeUp timer.
  * @param  NewState: new state of the WakeUp timer.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
ErrorStatus ERTC_WakeUpCmd(FunctionalState NewState)
{
  __IO uint32_t wutcounter = 0x00;
  uint32_t wutwfstatus = 0x00;
  ErrorStatus status = ERROR;

  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  /* Disable the write protection for ERTC registers */
  ERTC->WPR = 0xCA;
  ERTC->WPR = 0x53;

  if (NewState != DISABLE)
  {
    /* Enable the Wakeup Timer */
    ERTC->CTRL |= (uint32_t)ERTC_CTRL_WATE;
    status = SUCCESS;
  }
  else
  {
    /* Disable the Wakeup Timer */
    ERTC->CTRL &= (uint32_t)~ERTC_CTRL_WATE;
    /* Wait till ERTC WUTWF flag is set and if Time out is reached exit */
    do
    {
      wutwfstatus = ERTC->ISTS & ERTC_ISTS_WATWF;
      wutcounter++;
    } while((wutcounter != INITMODE_TMROUT) && (wutwfstatus == 0x00));

    if ((ERTC->ISTS & ERTC_ISTS_WATWF) == RESET)
    {
      status = ERROR;
    }
    else
    {
      status = SUCCESS;
    }
  }

  /* Enable the write protection for ERTC registers */
  ERTC->WPR = 0xFF;

  return status;
}

/**
  * @}
  */

/** @defgroup RTC_Group5 Daylight Saving configuration functions
 *  @brief   Daylight Saving configuration functions
 *
@verbatim
 ===============================================================================
              ##### Daylight Saving configuration functions #####
 ===============================================================================

 [..] This section provide functions allowing to configure the ERTC DayLight Saving.

@endverbatim
  * @{
  */

/**
  * @brief  Adds or substract one hour from the current time.
  * @param  RTC_DayLightSaveOperation: the value of hour adjustment.
  *          This parameter can be one of the following values:
  *            @arg ERTC_DayLightSaving_SUB1H: Substract one hour (winter time)
  *            @arg ERTC_DayLightSaving_ADD1H: Add one hour (summer time)
  * @param  ERTC_StoreOperation: Specifies the value to be written in the BCK bit
  *                            in CTRL register to store the operation.
  *          This parameter can be one of the following values:
  *            @arg ERTC_StoreOperation_Reset: BCK Bit Reset
  *            @arg ERTC_StoreOperation_Set: BCK Bit Set
  * @retval None
  */
void ERTC_DayLightSavingConfig(uint32_t ERTC_DayLightSaving, uint32_t ERTC_StoreOperation)
{
  /* Check the parameters */
  assert_param(IS_ERTC_DAYLIGHT_SAVING(ERTC_DayLightSaving));
  assert_param(IS_ERTC_STORE_OPERATION(ERTC_StoreOperation));

  /* Disable the write protection for ERTC registers */
  ERTC->WPR = 0xCA;
  ERTC->WPR = 0x53;

  /* Clear the bits to be configured */
  ERTC->CTRL &= (uint32_t)~(ERTC_CTRL_BKP);

  /* Configure the RTC_CR register */
  ERTC->CTRL |= (uint32_t)(ERTC_DayLightSaving | ERTC_StoreOperation);

  /* Enable the write protection for ERTC registers */
  ERTC->WPR = 0xFF;
}

/**
  * @brief  Returns the ERTC Day Light Saving stored operation.
  * @param  None
  * @retval ERTC Day Light Saving stored operation.
  *          - ERTC_StoreOperation_Reset
  *          - ERTC_StoreOperation_Set
  */
uint32_t ERTC_GetStoreOperation(void)
{
  return (ERTC->CTRL & ERTC_CTRL_BKP);
}

/**
  * @}
  */

/** @defgroup RTC_Group6 Output pin Configuration function
 *  @brief   Output pin Configuration function
 *
@verbatim
 ===============================================================================
                 ##### Output pin Configuration function #####
 ===============================================================================

 [..] This section provide functions allowing to configure the ERTC Output source.

@endverbatim
  * @{
  */

/**
  * @brief  Configures the ERTC output source (AFO_ALARM).
  * @param  ERTC_Output: Specifies which signal will be routed to the ERTC output.
  *          This parameter can be one of the following values:
  *            @arg ERTC_Output_Disable: No output selected
  *            @arg ERTC_Output_AlarmA: signal of AlarmA mapped to output
  *            @arg ERTC_Output_AlarmB: signal of AlarmB mapped to output
  *            @arg ERTC_Output_WakeUp: signal of WakeUp mapped to output
  * @param  ERTC_OutputPolarity: Specifies the polarity of the output signal.
  *          This parameter can be one of the following:
  *            @arg ERTC_OutputPolarity_High: The output pin is high when the
  *                                 ALRAF/ALRBF/WUTF is high (depending on OSEL)
  *            @arg ERTC_OutputPolarity_Low: The output pin is low when the
  *                                 ALRAF/ALRBF/WUTF is high (depending on OSEL)
  * @retval None
  */
void ERTC_OutputConfig(uint32_t ERTC_Output, uint32_t ERTC_OutputPolarity)
{
  /* Check the parameters */
  assert_param(IS_ERTC_OUTPUT(ERTC_Output));
  assert_param(IS_ERTC_OUTPUT_OPOL(ERTC_OutputPolarity));

  /* Disable the write protection for ERTC registers */
  ERTC->WPR = 0xCA;
  ERTC->WPR = 0x53;

