RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_ertc.c
  /* Clear the bits to be configured */
  ERTC->CTRL &= (uint32_t)~(ERTC_CTRL_OSEL | ERTC_CTRL_OPOL);

  /* Configure the output selection and polarity */
  ERTC->CTRL |= (uint32_t)(ERTC_Output | ERTC_OutputPolarity);

  /* Enable the write protection for ERTC registers */
  ERTC->WPR = 0xFF;
}

/**
  * @}
  */

/** @defgroup RTC_Group7 Digital Calibration configuration functions
 *  @brief   Coarse Calibration configuration functions
 *
@verbatim
 ===============================================================================
              ##### Digital Calibration configuration functions #####
 ===============================================================================

@endverbatim
  * @{
  */

/**
  * @brief  Configures the Coarse calibration parameters.
  * @param  ERTC_CalSign: specifies the sign of the coarse calibration value.
  *          This parameter can be  one of the following values:
  *            @arg ERTC_DataCalSign_Positive: The value sign is positive
  *            @arg ERTC_DataCalSign_Negative: The value sign is negative
  * @param  Value: value of coarse calibration expressed in ppm (coded on 5 bits).
  *
  * @note   This Calibration value should be between 0 and 63 when using negative
  *         sign with a 2-ppm step.
  *
  * @note   This Calibration value should be between 0 and 126 when using positive
  *         sign with a 4-ppm step.
  *
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: ERTC Coarse calibration are initialized
  *          - ERROR: ERTC Coarse calibration are not initialized
  */
ErrorStatus ERTC_CoarseCalConfig(uint32_t ERTC_CalSign, uint32_t Value)
{
  ErrorStatus status = ERROR;

  /* Check the parameters */
  assert_param(IS_ERTC_DATACAL_SIGN(ERTC_CalSign));
  assert_param(IS_ERTC_DATACAL_VALUE(Value));

  /* Disable the write protection for ERTC registers */
  ERTC->WPR = 0xCA;
  ERTC->WPR = 0x53;

  /* Set Initialization mode */
  if (ERTC_EnterInitMode() == ERROR)
  {
    status = ERROR;
  }
  else
  {
    /* Set the coarse calibration value */
    ERTC->CAL = (uint32_t)(ERTC_CalSign | Value);
    /* Exit Initialization mode */
    ERTC_ExitInitMode();

    status = SUCCESS;
  }

  /* Enable the write protection for ERTC registers */
  ERTC->WPR = 0xFF;

  return status;
}

/**
  * @brief  Enables or disables the Coarse calibration process.
  * @param  NewState: new state of the Coarse calibration.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: ERTC Coarse calibration are enabled/disabled
  *          - ERROR: ERTC Coarse calibration are not enabled/disabled
  */
ErrorStatus ERTC_CoarseCalCmd(FunctionalState NewState)
{
  ErrorStatus status = ERROR;

  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  /* Disable the write protection for ERTC registers */
  ERTC->WPR = 0xCA;
  ERTC->WPR = 0x53;

  /* Set Initialization mode */
  if (ERTC_EnterInitMode() == ERROR)
  {
    status =  ERROR;
  }
  else
  {
    if (NewState != DISABLE)
    {
      /* Enable the Coarse Calibration */
      ERTC->CTRL |= (uint32_t)ERTC_CTRL_CDCE;
    }
    else
    {
      /* Disable the Coarse Calibration */
      ERTC->CTRL &= (uint32_t)~ERTC_CTRL_CDCE;
    }
    /* Exit Initialization mode */
    ERTC_ExitInitMode();

    status = SUCCESS;
  }

  /* Enable the write protection for ERTC registers */
  ERTC->WPR = 0xFF;

  return status;
}

/**
  * @brief  Enables or disables the ERTC clock to be output through the relative pin.
  * @param  NewState: new state of the digital calibration Output.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ERTC_CalOutputCmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  /* Disable the write protection for ERTC registers */
  ERTC->WPR = 0xCA;
  ERTC->WPR = 0x53;

  if (NewState != DISABLE)
  {
    /* Enable the ERTC clock output */
    ERTC->CTRL |= (uint32_t)ERTC_CTRL_CALOE;
  }
  else
  {
    /* Disable the ERTC clock output */
    ERTC->CTRL &= (uint32_t)~ERTC_CTRL_CALOE;
  }

  /* Enable the write protection for ERTC registers */
  ERTC->WPR = 0xFF;
}

/**
  * @brief  Configure the Calibration Pinout (RTC_CALIB) Selection (1Hz or 512Hz).
  * @param  ERTC_CalOutput : Select the Calibration output Selection .
  *   This parameter can be one of the following values:
  *     @arg ERTC_CalOutput_512Hz: A signal has a regular waveform at 512Hz.
  *     @arg ERTC_CalOutput_1Hz  : A signal has a regular waveform at 1Hz.
  * @retval None
*/
void ERTC_CalOutputConfig(uint32_t ERTC_CalOutput)
{
  /* Check the parameters */
  assert_param(IS_ERTC_CAL_OUTPUT(ERTC_CalOutput));

  /* Disable the write protection for ERTC registers */
  ERTC->WPR = 0xCA;
  ERTC->WPR = 0x53;

  /*clear flags before configuration */
  ERTC->CTRL &= (uint32_t)~(ERTC_CTRL_CALSEL);

  /* Configure the RTC_CR register */
  ERTC->CTRL |= (uint32_t)ERTC_CalOutput;

  /* Enable the write protection for ERTC registers */
  ERTC->WPR = 0xFF;
}

/**
  * @brief  Configures the Smooth Calibration Settings.
  * @param  ERTC_SmoothCalPeriod : Select the Smooth Calibration Period.
  *   This parameter can be can be one of the following values:
  *     @arg ERTC_SmoothCalPeriod_32sec : The smooth calibration period is 32s.
  *     @arg ERTC_SmoothCalPeriod_16sec : The smooth calibration period is 16s.
  *     @arg ERTC_SmoothCalPeriod_8sec  : The smooth calibration period is 8s.
  * @param  ERTC_SmoothCalPlusPulses : Select to Set or reset the CALP bit.
  *   This parameter can be one of the following values:
  *     @arg ERTC_SmoothCalAddPulses_Set  : Add one RTCCLK pulse every 2**11 pulses.
  *     @arg ERTC_SmoothCalAddPulses_Reset: No RTCCLK pulses are added.
  * @param  ERTC_SmouthCalMinusPulsesValue: Select the value of CALM[8:0] bits.
  *   This parameter can be one any value from 0 to 0x000001FF.
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: ERTC Calib registers are configured
  *          - ERROR: ERTC Calib registers are not configured
*/
ErrorStatus ERTC_SmoothCalConfig(uint32_t ERTC_SmoothCalPeriod,
                                  uint32_t ERTC_SmoothCalPlusPulses,
                                  uint32_t ERTC_SmouthCalMinusPulsesValue)
{
  ErrorStatus status = ERROR;
  uint32_t recalpfcount = 0;

  /* Check the parameters */
  assert_param(IS_ERTC_SMOOTH_CAL_PERIOD(ERTC_SmoothCalPeriod));
  assert_param(IS_ERTC_SMOOTH_CAL_ADD(ERTC_SmoothCalPlusPulses));
  assert_param(IS_ERTC_SMOOTH_CAL_VALUE(ERTC_SmouthCalMinusPulsesValue));

  /* Disable the write protection for ERTC registers */
  ERTC->WPR = 0xCA;
  ERTC->WPR = 0x53;

