RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_ertc.c
  /* check if a calibration is pending*/
  if ((ERTC->ISTS & ERTC_ISTS_RECALPDF) != RESET)
  {
    /* wait until the Calibration is completed*/
    while (((ERTC->ISTS & ERTC_ISTS_RECALPDF) != RESET) && (recalpfcount != RECALPDF_TMROUT))
    {
      recalpfcount++;
    }
  }

  /* check if the calibration pending is completed or if there is no calibration operation at all*/
  if ((ERTC->ISTS & ERTC_ISTS_RECALPDF) == RESET)
  {
    /* Configure the Smooth calibration settings */
    ERTC->CCR = (uint32_t)((uint32_t)ERTC_SmoothCalPeriod | (uint32_t)ERTC_SmoothCalPlusPulses | (uint32_t)ERTC_SmouthCalMinusPulsesValue);

    status = SUCCESS;
  }
  else
  {
    status = ERROR;
  }

  /* Enable the write protection for ERTC registers */
  ERTC->WPR = 0xFF;

  return (ErrorStatus)(status);
}

/**
  * @}
  */


/** @defgroup RTC_Group8 TimeStamp configuration functions
 *  @brief   TimeStamp configuration functions
 *
@verbatim
 ===============================================================================
                 ##### TimeStamp configuration functions #####
 ===============================================================================

@endverbatim
  * @{
  */

/**
  * @brief  Enables or Disables the ERTC TimeStamp functionality with the
  *         specified time stamp pin stimulating edge.
  * @param  ERTC_TimeStampEdge: Specifies the pin edge on which the TimeStamp is
  *         activated.
  *          This parameter can be one of the following:
  *            @arg ERTC_TimeStampEdge_Rising: the Time stamp event occurs on the rising
  *                                    edge of the related pin.
  *            @arg ERTC_TimeStampEdge_Falling: the Time stamp event occurs on the
  *                                     falling edge of the related pin.
  * @param  NewState: new state of the TimeStamp.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ERTC_TimeStampCmd(uint32_t ERTC_TimeStampEdge, FunctionalState NewState)
{
  uint32_t tmpreg = 0;

  /* Check the parameters */
  assert_param(IS_ERTC_TIMESTAMP_EDGE(ERTC_TimeStampEdge));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  /* Get the RTC_CR register and clear the bits to be configured */
  tmpreg = (uint32_t)(ERTC->CTRL & (uint32_t)~(ERTC_CTRL_TSEDGE | ERTC_CTRL_TSE));

  /* Get the new configuration */
  if (NewState != DISABLE)
  {
    tmpreg |= (uint32_t)(ERTC_TimeStampEdge | ERTC_CTRL_TSE);
  }
  else
  {
    tmpreg |= (uint32_t)(ERTC_TimeStampEdge);
  }

  /* Disable the write protection for ERTC registers */
  ERTC->WPR = 0xCA;
  ERTC->WPR = 0x53;

  /* Configure the Time Stamp TSEDGE and Enable bits */
  ERTC->CTRL = (uint32_t)tmpreg;

  /* Enable the write protection for ERTC registers */
  ERTC->WPR = 0xFF;
}

/**
  * @brief  Get the ERTC TimeStamp value and masks.
  * @param  ERTC_Format: specifies the format of the output parameters.
  *          This parameter can be one of the following values:
  *            @arg ERTC_Format_BIN: Binary data format
  *            @arg ERTC_Format_BCD: BCD data format
  * @param ERTC_StampTimeStruct: pointer to a ERTC_TimeType structure that will
  *                             contains the TimeStamp time values.
  * @param ERTC_StampDateStruct: pointer to a ERTC_DateType structure that will
  *                             contains the TimeStamp date values.
  * @retval None
  */
void ERTC_GetTimeStamp(uint32_t ERTC_Format, ERTC_TimeType* ERTC_StampTimeStruct,
                                      ERTC_DateType* ERTC_StampDateStruct)
{
  uint32_t tmptime = 0, tmpdate = 0;

  /* Check the parameters */
  assert_param(IS_ERTC_FORMAT(ERTC_Format));

  /* Get the TimeStamp time and date registers values */
  tmptime = (uint32_t)(ERTC->TSTM & ERTC_TIME_RESERVED_MASK);
  tmpdate = (uint32_t)(ERTC->TSDT & ERTC_DATE_RESERVED_MASK);

  /* Fill the Time structure fields with the read parameters */
  ERTC_StampTimeStruct->ERTC_Hours = (uint8_t)((tmptime & (ERTC_TIME_HT | ERTC_TIME_HU)) >> 16);
  ERTC_StampTimeStruct->ERTC_Minutes = (uint8_t)((tmptime & (ERTC_TIME_MT | ERTC_TIME_MU)) >> 8);
  ERTC_StampTimeStruct->ERTC_Seconds = (uint8_t)(tmptime & (ERTC_TIME_ST | ERTC_TIME_SU));
  ERTC_StampTimeStruct->ERTC_AMPM = (uint8_t)((tmptime & (ERTC_TIME_AMPM)) >> 16);

  /* Fill the Date structure fields with the read parameters */
  ERTC_StampDateStruct->ERTC_Year = 0;
  ERTC_StampDateStruct->ERTC_Month = (uint8_t)((tmpdate & (ERTC_DATE_MT | ERTC_DATE_MU)) >> 8);
  ERTC_StampDateStruct->ERTC_Date = (uint8_t)(tmpdate & (ERTC_DATE_DT | ERTC_DATE_DU));
  ERTC_StampDateStruct->ERTC_WeekDay = (uint8_t)((tmpdate & (ERTC_DATE_WK)) >> 13);

  /* Check the input parameters format */
  if (ERTC_Format == ERTC_Format_BIN)
  {
    /* Convert the Time structure parameters to Binary format */
    ERTC_StampTimeStruct->ERTC_Hours = (uint8_t)ERTC_Bcd2ToByte(ERTC_StampTimeStruct->ERTC_Hours);
    ERTC_StampTimeStruct->ERTC_Minutes = (uint8_t)ERTC_Bcd2ToByte(ERTC_StampTimeStruct->ERTC_Minutes);
    ERTC_StampTimeStruct->ERTC_Seconds = (uint8_t)ERTC_Bcd2ToByte(ERTC_StampTimeStruct->ERTC_Seconds);

    /* Convert the Date structure parameters to Binary format */
    ERTC_StampDateStruct->ERTC_Month = (uint8_t)ERTC_Bcd2ToByte(ERTC_StampDateStruct->ERTC_Month);
    ERTC_StampDateStruct->ERTC_Date = (uint8_t)ERTC_Bcd2ToByte(ERTC_StampDateStruct->ERTC_Date);
    ERTC_StampDateStruct->ERTC_WeekDay = (uint8_t)ERTC_Bcd2ToByte(ERTC_StampDateStruct->ERTC_WeekDay);
  }
}

/**
  * @brief  Get the ERTC timestamp Sub seconds value.
  * @param  None
  * @retval ERTC current timestamp Sub seconds value.
  */
uint32_t ERTC_GetTimeStampSubSecond(void)
{
  /* Get timestamp sub seconds values from the correspondent registers */
  return (uint32_t)(ERTC->TSSBS);
}

/**
  * @}
  */

/** @defgroup RTC_Group9 Tampers configuration functions
 *  @brief   Tampers configuration functions
 *
@verbatim
 ===============================================================================
                 ##### Tampers configuration functions #####
 ===============================================================================

@endverbatim
  * @{
  */

/**
  * @brief  Configures the select Tamper pin edge.
  * @param  ERTC_Tamper: Selected tamper pin.
  *          This parameter can be ERTC_TAMP_1 or ERTC_Tamper 2
  * @param  ERTC_TamperTrigger: Specifies the trigger on the tamper pin that
  *         stimulates tamper event.
  *   This parameter can be one of the following values:
  *     @arg ERTC_TamperTrig_RisingEdge: Rising Edge of the tamper pin causes tamper event.
  *     @arg ERTC_TamperTrig_FallingEdge: Falling Edge of the tamper pin causes tamper event.
  *     @arg ERTC_TamperTrig_LowLevel: Low Level of the tamper pin causes tamper event.
  *     @arg ERTC_TamperTrig_HighLevel: High Level of the tamper pin causes tamper event.
  * @retval None
  */
void ERTC_TamperTriggerConfig(uint32_t ERTC_Tamper, uint32_t ERTC_TamperTrigger)
{
  /* Check the parameters */
  assert_param(IS_ERTC_TAMP(ERTC_Tamper));
  assert_param(IS_ERTC_TAMPER_TRIG(ERTC_TamperTrigger));

  if (ERTC_TamperTrigger == ERTC_TamperTrig_RisingEdge)
  {
    /* Configure the RTC_TAFCR register */
    ERTC->TPAF &= (uint32_t)((uint32_t)~(ERTC_Tamper << 1));
  }
  else
  {
    /* Configure the RTC_TAFCR register */
    ERTC->TPAF |= (uint32_t)(ERTC_Tamper << 1);
  }
}

/**
  * @brief  Enables or Disables the Tamper detection.
  * @param  ERTC_Tamper: Selected tamper pin.
  *          This parameter can be ERTC_TAMP_1 or ERTC_TAMP_2
  * @param  NewState: new state of the tamper pin.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ERTC_TamperCmd(uint32_t ERTC_Tamper, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_ERTC_TAMP(ERTC_Tamper));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the selected Tamper pin */
    ERTC->TPAF |= (uint32_t)ERTC_Tamper;
  }
  else
  {
    /* Disable the selected Tamper pin */
    ERTC->TPAF &= (uint32_t)~ERTC_Tamper;
  }
}

/**
  * @brief  Configures the Tampers Filter.
  * @param  ERTC_TamperFilter: Specifies the tampers filter.
  *   This parameter can be one of the following values:
  *     @arg ERTC_TamperFilter_Disable: Tamper filter is disabled.
  *     @arg ERTC_TamperFilter_2Sample: Tamper is activated after 2 consecutive
  *                                    samples at the active level
  *     @arg ERTC_TamperFilter_4Sample: Tamper is activated after 4 consecutive
  *                                    samples at the active level
  *     @arg ERTC_TamperFilter_8Sample: Tamper is activated after 8 consecutive
  *                                    samples at the active level
  * @retval None
  */
void ERTC_TamperFilterConfig(uint32_t ERTC_TamperFilter)
{
  /* Check the parameters */
  assert_param(IS_ERTC_TAMPER_FILTER(ERTC_TamperFilter));

