RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_ertc.c
  /* Clear TAMPFLT[1:0] bits in the RTC_TAFCR register */
  ERTC->TPAF &= (uint32_t)~(ERTC_TPAF_TMFLT);

  /* Configure the RTC_TAFCR register */
  ERTC->TPAF |= (uint32_t)ERTC_TamperFilter;
}

/**
  * @brief  Configures the Tampers Sampling Frequency.
  * @param  ERTC_TamperSamplingFreq: Specifies the tampers Sampling Frequency.
  *   This parameter can be one of the following values:
  *     @arg ERTC_TamperSamplingFreq_CLK_Div32768: Each of the tamper inputs are sampled
  *                                           with a frequency =  RTCCLK / 32768
  *     @arg ERTC_TamperSamplingFreq_CLK_Div16384: Each of the tamper inputs are sampled
  *                                           with a frequency =  RTCCLK / 16384
  *     @arg ERTC_TamperSamplingFreq_CLK_Div8192: Each of the tamper inputs are sampled
  *                                           with a frequency =  RTCCLK / 8192
  *     @arg ERTC_TamperSamplingFreq_CLK_Div4096: Each of the tamper inputs are sampled
  *                                           with a frequency =  RTCCLK / 4096
  *     @arg ERTC_TamperSamplingFreq_CLK_Div2048: Each of the tamper inputs are sampled
  *                                           with a frequency =  RTCCLK / 2048
  *     @arg ERTC_TamperSamplingFreq_CLK_Div1024: Each of the tamper inputs are sampled
  *                                           with a frequency =  RTCCLK / 1024
  *     @arg ERTC_TamperSamplingFreq_CLK_Div512: Each of the tamper inputs are sampled
  *                                           with a frequency =  RTCCLK / 512
  *     @arg ERTC_TamperSamplingFreq_CLK_Div256: Each of the tamper inputs are sampled
  *                                           with a frequency =  RTCCLK / 256
  * @retval None
  */
void ERTC_TamperSamplingFreqConfig(uint32_t ERTC_TamperSamplingFreq)
{
  /* Check the parameters */
  assert_param(IS_ERTC_TAMPER_SAMPLING_FREQ(ERTC_TamperSamplingFreq));

  /* Clear TAMPFREQ[2:0] bits in the RTC_TAFCR register */
  ERTC->TPAF &= (uint32_t)~(ERTC_TPAF_TMFREQ);

  /* Configure the RTC_TAFCR register */
  ERTC->TPAF |= (uint32_t)ERTC_TamperSamplingFreq;
}

/**
  * @brief  Configures the Tampers Pins input Precharge Duration.
  * @param  ERTC_TamperPrechargeDuration: Specifies the Tampers Pins input
  *         Precharge Duration.
  *   This parameter can be one of the following values:
  *     @arg ERTC_TamperPrechargeDuration_1RTCCLK: Tamper pins are precharged before sampling during 1 RTCCLK cycle
  *     @arg ERTC_TamperPrechargeDuration_2RTCCLK: Tamper pins are precharged before sampling during 2 RTCCLK cycle
  *     @arg ERTC_TamperPrechargeDuration_4RTCCLK: Tamper pins are precharged before sampling during 4 RTCCLK cycle
  *     @arg ERTC_TamperPrechargeDuration_8RTCCLK: Tamper pins are precharged before sampling during 8 RTCCLK cycle
  * @retval None
  */
void ERTC_TamperPinsPrechargeDuration(uint32_t ERTC_TamperPrechargeDuration)
{
  /* Check the parameters */
  assert_param(IS_ERTC_TAMPER_PRECHARGE_DURATION(ERTC_TamperPrechargeDuration));

  /* Clear TAMPPRCH[1:0] bits in the RTC_TAFCR register */
  ERTC->TPAF &= (uint32_t)~(ERTC_TPAF_TMPRCH);

  /* Configure the RTC_TAFCR register */
  ERTC->TPAF |= (uint32_t)ERTC_TamperPrechargeDuration;
}

/**
  * @brief  Enables or Disables the TimeStamp on Tamper Detection Event.
  * @note   The timestamp is valid even the TSE bit in tamper control register
  *         is reset.
  * @param  NewState: new state of the timestamp on tamper event.
  *         This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ERTC_TimeStampOnTamperDetectionCmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Save timestamp on tamper detection event */
    ERTC->TPAF |= (uint32_t)ERTC_TPAF_TMTS;
  }
  else
  {
    /* Tamper detection does not cause a timestamp to be saved */
    ERTC->TPAF &= (uint32_t)~ERTC_TPAF_TMTS;
  }
}

/**
  * @brief  Enables or Disables the Precharge of Tamper pin.
  * @param  NewState: new state of tamper pull up.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ERTC_TamperPullUpCmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));

 if (NewState != DISABLE)
  {
    /* Enable precharge of the selected Tamper pin */
    ERTC->TPAF &= (uint32_t)~ERTC_TPAF_TMPUDIS;
  }
  else
  {
    /* Disable precharge of the selected Tamper pin */
    ERTC->TPAF |= (uint32_t)ERTC_TPAF_TMPUDIS;
  }
}

/**
  * @}
  */

/** @defgroup RTC_Group10 Backup Data Registers configuration functions
 *  @brief   Backup Data Registers configuration functions
 *
@verbatim
 ===============================================================================
             ##### Backup Data Registers configuration functions #####
 ===============================================================================

@endverbatim
  * @{
  */

/**
  * @brief  Writes a data in a specified ERTC Backup data register.
  * @param  ERTC_BKP_DT: ERTC Backup data Register number.
  *          This parameter can be: ERTC_BKP_DTx where x can be from 0 to 19 to
  *                          specify the register.
  * @param  Data: Data to be written in the specified ERTC Backup data register.
  * @retval None
  */
void ERTC_WriteBackupRegister(uint32_t ERTC_BKP_DT, uint32_t Data)
{
  __IO uint32_t tmp = 0;

  /* Check the parameters */
  assert_param(IS_ERTC_BKP(ERTC_BKP_DT));

  tmp = ERTC_BASE + 0x50;
  tmp += (ERTC_BKP_DT * 4);

  /* Write the specified register */
  *(__IO uint32_t *)tmp = (uint32_t)Data;
}

/**
  * @brief  Reads data from the specified ERTC Backup data Register.
  * @param  ERTC_BKP_DT: ERTC Backup data Register number.
  *          This parameter can be: ERTC_BKP_DTx where x can be from 0 to 19 to
  *                          specify the register.
  * @retval None
  */
uint32_t ERTC_ReadBackupRegister(uint32_t ERTC_BKP_DT)
{
  __IO uint32_t tmp = 0;

  /* Check the parameters */
  assert_param(IS_ERTC_BKP(ERTC_BKP_DT));

