RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_ertc.c
  tmp = ERTC_BASE + 0x50;
  tmp += (ERTC_BKP_DT * 4);

  /* Read the specified register */
  return (*(__IO uint32_t *)tmp);
}

/**
  * @}
  */

/** @defgroup RTC_Group11 ERTC Tamper and TimeStamp Pins Selection and Output Type Config configuration functions
 *  @brief   ERTC Tamper and TimeStamp Pins Selection and Output Type Config
 *           configuration functions
 *
@verbatim
 ==================================================================================================
 ##### ERTC Tamper and TimeStamp Pins Selection and Output Type Config configuration functions #####
 ==================================================================================================

@endverbatim
  * @{
  */

/**
  * @brief  Selects the ERTC Tamper Pin.
  * @param  ERTC_TamperPin: specifies the ERTC Tamper Pin.
  *          This parameter can be one of the following values:
  *            @arg ERTC_TAMPPIN_Default: RTC_AF1 is used as ERTC Tamper Pin.
  *            @arg ERTC_TAMPPIN_Pos1: RTC_AF2 is selected as ERTC Tamper Pin.
  * @retval None
  */
void ERTC_TamperPinSelection(uint32_t ERTC_TamperPin)
{
  /* Check the parameters */
  assert_param(IS_ERTC_TAMP_PIN(ERTC_TamperPin));

  ERTC->TPAF &= (uint32_t)~(ERTC_TPAF_TMPINSEL);
  ERTC->TPAF |= (uint32_t)(ERTC_TamperPin);
}

/**
  * @brief  Selects the ERTC TimeStamp Pin.
  * @param  ERTC_TimeStampPin: specifies the ERTC TimeStamp Pin.
  *          This parameter can be one of the following values:
  *            @arg ERTC_TimeStampPin_PC13: PC13 is selected as ERTC TimeStamp Pin.
  *            @arg ERTC_TimeStampPin_PI8: PI8 is selected as ERTC TimeStamp Pin.
  * @retval None
  */
void ERTC_TimeStampPinSelection(uint32_t ERTC_TimeStampPin)
{
  /* Check the parameters */
  assert_param(IS_ERTC_TIMESTAMP_PIN(ERTC_TimeStampPin));

  ERTC->TPAF &= (uint32_t)~(ERTC_TPAF_TSINSEL);
  ERTC->TPAF |= (uint32_t)(ERTC_TimeStampPin);
}

/**
  * @brief  Configures the ERTC Output Pin mode.
  * @param  ERTC_OutputType: specifies the ERTC Output (PC13) pin mode.
  *          This parameter can be one of the following values:
  *            @arg ERTC_OutputType_OpenDrain: ERTC Output (PC13) is configured in
  *                                    Open Drain mode.
  *            @arg ERTC_OutputType_PushPull:  ERTC Output (PC13) is configured in
  *                                    Push Pull mode.
  * @retval None
  */
void ERTC_OutputTypeConfig(uint32_t ERTC_OutputType)
{
  /* Check the parameters */
  assert_param(IS_ERTC_OUTPUT_TYPE(ERTC_OutputType));

  ERTC->TPAF &= (uint32_t)~(ERTC_TPAF_ALAOUTTYPE);
  ERTC->TPAF |= (uint32_t)(ERTC_OutputType);
}

/**
  * @}
  */

/** @defgroup RTC_Group12 Shift control synchronisation functions
 *  @brief   Shift control synchronisation functions
 *
@verbatim
 ===============================================================================
              ##### Shift control synchronisation functions #####
 ===============================================================================

@endverbatim
  * @{
  */

/**
  * @brief  Configures the Synchronization Shift Control Settings.
  * @note   When REFCKON is set, firmware must not write to Shift control register
  * @param  ERTC_ShiftAdd1S : Select to add or not 1 second to the time Calendar.
  *   This parameter can be one of the following values :
  *     @arg ERTC_ShiftAdd1S_Set  : Add one second to the clock calendar.
  *     @arg ERTC_ShiftAdd1S_Reset: No effect.
  * @param  ERTC_ShiftSubFS: Select the number of Second Fractions to Substitute.
  *         This parameter can be one any value from 0 to 0x7FFF.
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: ERTC Shift registers are configured
  *          - ERROR: ERTC Shift registers are not configured
*/
ErrorStatus ERTC_SynchroShiftConfig(uint32_t ERTC_ShiftAdd1S, uint32_t ERTC_ShiftSubFS)
{
  ErrorStatus status = ERROR;
  uint32_t shpfcount = 0;

  /* Check the parameters */
  assert_param(IS_ERTC_SHIFT_ADD1S(ERTC_ShiftAdd1S));
  assert_param(IS_ERTC_SHIFT_SUBFS(ERTC_ShiftSubFS));

  /* Disable the write protection for ERTC registers */
  ERTC->WPR = 0xCA;
  ERTC->WPR = 0x53;

  /* Check if a Shift is pending*/
  if ((ERTC->ISTS & ERTC_ISTS_SFP) != RESET)
  {
    /* Wait until the shift is completed*/
    while (((ERTC->ISTS & ERTC_ISTS_SFP) != RESET) && (shpfcount != SFP_TMROUT))
    {
      shpfcount++;
    }
  }

  /* Check if the Shift pending is completed or if there is no Shift operation at all*/
  if ((ERTC->ISTS & ERTC_ISTS_SFP) == RESET)
  {
    /* check if the reference clock detection is disabled */
    if((ERTC->CTRL & ERTC_CTRL_RFCKON) == RESET)
    {
      /* Configure the Shift settings */
      ERTC->SFCTR = (uint32_t)(uint32_t)(ERTC_ShiftSubFS) | (uint32_t)(ERTC_ShiftAdd1S);

      if(ERTC_WaitForSynchro() == ERROR)
      {
        status = ERROR;
      }
      else
      {
        status = SUCCESS;
      }
    }
    else
    {
      status = ERROR;
    }
  }
  else
  {
    status = ERROR;
  }

  /* Enable the write protection for ERTC registers */
  ERTC->WPR = 0xFF;

  return (ErrorStatus)(status);
}

/**
  * @}
  */

/** @defgroup RTC_Group13 Interrupts and flags management functions
 *  @brief   Interrupts and flags management functions
 *
@verbatim
 ===============================================================================
              ##### Interrupts and flags management functions #####
 ===============================================================================
 [..] All ERTC interrupts are connected to the EXTI controller.

   (+) To enable the ERTC Alarm interrupt, the following sequence is required:
       (++) Configure and enable the EXTI Line 17 in interrupt mode and select
            the rising edge sensitivity using the EXTI_Init() function.
       (++) Configure and enable the ERTC_Alarm IRQ channel in the NVIC using the
            NVIC_Init() function.
       (++) Configure the ERTC to generate ERTC alarms (Alarm A and/or Alarm B) using
            the ERTC_SetAlarmValue() and ERTC_AlarmCmd() functions.

   (+) To enable the ERTC Wakeup interrupt, the following sequence is required:
       (++) Configure and enable the EXTI Line 22 in interrupt mode and select the
            rising edge sensitivity using the EXTI_Init() function.
       (++) Configure and enable the RTC_WKUP IRQ channel in the NVIC using the
            NVIC_Init() function.
       (++) Configure the ERTC to generate the ERTC wakeup timer event using the
            ERTC_WakeUpClockConfig(), ERTC_SetWakeUpCounter() and ERTC_WakeUpCmd()
            functions.

   (+) To enable the ERTC Tamper interrupt, the following sequence is required:
       (++) Configure and enable the EXTI Line 21 in interrupt mode and select
            the rising edge sensitivity using the EXTI_Init() function.
       (++) Configure and enable the TAMP_STAMP IRQ channel in the NVIC using the
            NVIC_Init() function.
       (++) Configure the ERTC to detect the ERTC tamper event using the
            ERTC_TamperTriggerConfig() and ERTC_TamperCmd() functions.

   (+) To enable the ERTC TimeStamp interrupt, the following sequence is required:
       (++) Configure and enable the EXTI Line 21 in interrupt mode and select the
            rising edge sensitivity using the EXTI_Init() function.
       (++) Configure and enable the TAMP_STAMP IRQ channel in the NVIC using the
            NVIC_Init() function.
       (++) Configure the ERTC to detect the ERTC time stamp event using the
            ERTC_TimeStampCmd() functions.

@endverbatim
  * @{
  */

/**
  * @brief  Enables or disables the specified ERTC interrupts.
  * @param  ERTC_INT: specifies the ERTC interrupt sources to be enabled or disabled.
  *          This parameter can be any combination of the following values:
  *            @arg ERTC_INT_TS:  Time Stamp interrupt mask
  *            @arg ERTC_INT_WAT:  WakeUp Timer interrupt mask
  *            @arg ERTC_INT_ALB:  Alarm B interrupt mask
  *            @arg ERTC_INT_ALA:  Alarm A interrupt mask
  *            @arg ERTC_INT_TAMP: Tamper event interrupt mask
  * @param  NewState: new state of the specified ERTC interrupts.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ERTC_INTConfig(uint32_t ERTC_INT, FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_ERTC_CONFIG_INT(ERTC_INT));
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  /* Disable the write protection for ERTC registers */
  ERTC->WPR = 0xCA;
  ERTC->WPR = 0x53;

  if (NewState != DISABLE)
  {
    /* Configure the Interrupts in the RTC_CR register */
    ERTC->CTRL |= (uint32_t)(ERTC_INT & ~ERTC_TPAF_TMIE);
    /* Configure the Tamper Interrupt in the RTC_TAFCR */
    ERTC->TPAF |= (uint32_t)(ERTC_INT & ERTC_TPAF_TMIE);
  }
  else
  {
    /* Configure the Interrupts in the RTC_CR register */
    ERTC->CTRL &= (uint32_t)~(ERTC_INT & (uint32_t)~ERTC_TPAF_TMIE);
    /* Configure the Tamper Interrupt in the RTC_TAFCR */
    ERTC->TPAF &= (uint32_t)~(ERTC_INT & ERTC_TPAF_TMIE);
  }
  /* Enable the write protection for ERTC registers */
  ERTC->WPR = 0xFF;
}

/**
  * @brief  Checks whether the specified ERTC flag is set or not.
  * @param  ERTC_FLAG: specifies the flag to check.
  *          This parameter can be one of the following values:
  *            @arg ERTC_FLAG_RECALPDF: RECALPF event flag.
  *            @arg ERTC_FLAG_TP1F: Tamper 1 event flag
  *            @arg ERTC_FLAG_TP2F: Tamper 2 event flag
  *            @arg ERTC_FLAG_TSOF: Time Stamp OverFlow flag
  *            @arg ERTC_FLAG_TSF: Time Stamp event flag
  *            @arg ERTC_FLAG_WATF: WakeUp Timer flag
  *            @arg ERTC_FLAG_ALBF: Alarm B flag
  *            @arg ERTC_FLAG_ALAF: Alarm A flag
  *            @arg ERTC_FLAG_INITF: Initialization mode flag
  *            @arg ERTC_FLAG_RSF: Registers Synchronized flag
  *            @arg ERTC_FLAG_INITS: Registers Configured flag
  *            @arg ERTC_FLAG_SFP: Shift operation pending flag.
  *            @arg ERTC_FLAG_WATWF: WakeUp Timer Write flag
  *            @arg ERTC_FLAG_ALBWF: Alarm B Write flag
  *            @arg ERTC_FLAG_ALAWF: Alarm A write flag
  * @retval The new state of ERTC_FLAG (SET or RESET).
  */
FlagStatus ERTC_GetFlagStatus(uint32_t ERTC_FLAG)
{
  FlagStatus bitstatus = RESET;
  uint32_t tmpreg = 0;

  /* Check the parameters */
  assert_param(IS_ERTC_GET_FLAG(ERTC_FLAG));

  /* Get all the flags */
  tmpreg = (uint32_t)(ERTC->ISTS & ERTC_FLAGS_MASK);

  /* Return the status of the flag */
  if ((tmpreg & ERTC_FLAG) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  return bitstatus;
}

/**
  * @brief  Clears the ERTC's pending flags.
  * @param  ERTC_FLAG: specifies the ERTC flag to clear.
  *          This parameter can be any combination of the following values:
  *            @arg ERTC_FLAG_TP1F: Tamper 1 event flag
  *            @arg ERTC_FLAG_TP2F: Tamper 2 event flag
  *            @arg ERTC_FLAG_TSOF: Time Stamp Overflow flag
  *            @arg ERTC_FLAG_TSF: Time Stamp event flag
  *            @arg ERTC_FLAG_WATF: WakeUp Timer flag
  *            @arg ERTC_FLAG_ALBF: Alarm B flag
  *            @arg ERTC_FLAG_ALAF: Alarm A flag
  *            @arg ERTC_FLAG_RSF: Registers Synchronized flag
  * @retval None
  */
void ERTC_ClearFlag(uint32_t ERTC_FLAG)
{
  /* Check the parameters */
  assert_param(IS_ERTC_CLEAR_FLAG(ERTC_FLAG));

  /* Clear the Flags in the RTC_ISR register */
  ERTC->ISTS = (uint32_t)((uint32_t)(~((ERTC_FLAG | ERTC_ISTS_INITM)& 0x0000FFFF) | (uint32_t)(ERTC->ISTS & ERTC_ISTS_INITM)));
}

/**
  * @brief  Checks whether the specified ERTC interrupt has occurred or not.
  * @param  ERTC_INT: specifies the ERTC interrupt source to check.
  *          This parameter can be one of the following values:
  *            @arg ERTC_INT_TS: Time Stamp interrupt
  *            @arg ERTC_INT_WAT: WakeUp Timer interrupt
  *            @arg ERTC_INT_ALB: Alarm B interrupt
  *            @arg ERTC_INT_ALA: Alarm A interrupt
  *            @arg ERTC_INT_TAMP1: Tamper 1 event interrupt
  *            @arg ERTC_INT_TAMP2: Tamper 2 event interrupt
  * @retval The new state of ERTC_INT (SET or RESET).
  */
ITStatus ERTC_GetINTStatus(uint32_t ERTC_INT)
{
  ITStatus bitstatus = RESET;
  uint32_t tmpreg = 0, enablestatus = 0;

  /* Check the parameters */
  assert_param(IS_ERTC_GET_INT(ERTC_INT));

  /* Get the TAMPER Interrupt enable bit and pending bit */
  tmpreg = (uint32_t)(ERTC->TPAF & (ERTC_TPAF_TMIE));

  /* Get the Interrupt enable Status */
  enablestatus = (uint32_t)((ERTC->CTRL & ERTC_INT) | (tmpreg & (ERTC_INT >> 15)) | (tmpreg & (ERTC_INT >> 16)));

  /* Get the Interrupt pending bit */
  tmpreg = (uint32_t)((ERTC->ISTS & (uint32_t)(ERTC_INT >> 4)));

