RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/AT32F4xx_StdPeriph_Driver/src/at32f4xx_ertc.c
  /* Get the status of the Interrupt */
  if ((enablestatus != (uint32_t)RESET) && ((tmpreg & 0x0000FFFF) != (uint32_t)RESET))
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  return bitstatus;
}

/**
  * @brief  Clears the ERTC's interrupt pending bits.
  * @param  ERTC_INT: specifies the ERTC interrupt pending bit to clear.
  *          This parameter can be any combination of the following values:
  *            @arg ERTC_INT_TS: Time Stamp interrupt
  *            @arg ERTC_INT_WAT: WakeUp Timer interrupt
  *            @arg ERTC_INT_ALB: Alarm B interrupt
  *            @arg ERTC_INT_ALA: Alarm A interrupt
  *            @arg ERTC_INT_TAMP1: Tamper 1 event interrupt
  *            @arg ERTC_INT_TAMP2: Tamper 2 event interrupt
  * @retval None
  */
void ERTC_ClearINTPendingBINT(uint32_t ERTC_INT)
{
  uint32_t tmpreg = 0;

  /* Check the parameters */
  assert_param(IS_ERTC_CLEAR_INT(ERTC_INT));

  /* Get the RTC_ISR Interrupt pending bits mask */
  tmpreg = (uint32_t)(ERTC_INT >> 4);

  /* Clear the interrupt pending bits in the RTC_ISR register */
  ERTC->ISTS = (uint32_t)((uint32_t)(~((tmpreg | ERTC_ISTS_INITM)& 0x0000FFFF) | (uint32_t)(ERTC->ISTS & ERTC_ISTS_INITM)));
}

/**
  * @}
  */

/**
  * @brief  Converts a 2 digit decimal to BCD format.
  * @param  Value: Byte to be converted.
  * @retval Converted byte
  */
static uint8_t ERTC_ByteToBcd2(uint8_t Value)
{
  uint8_t bcdhigh = 0;

  while (Value >= 10)
  {
    bcdhigh++;
    Value -= 10;
  }

  return  ((uint8_t)(bcdhigh << 4) | Value);
}

/**
  * @brief  Convert from 2 digit BCD to Binary.
  * @param  Value: BCD value to be converted.
  * @retval Converted word
  */
static uint8_t ERTC_Bcd2ToByte(uint8_t Value)
{
  uint8_t tmp = 0;
  tmp = ((uint8_t)(Value & (uint8_t)0xF0) >> (uint8_t)0x4) * 10;
  return (tmp + (Value & (uint8_t)0x0F));
}

/**
  * @}
  */

#endif /* AT32F415xx */

/**
  * @}
  */

/**
  * @}
  */

